In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv(r'..\..\data\raw\awi_spam_emails.csv')
df2 = pd.read_csv(r'..\..\data\raw\email_spam.csv')
df3 = pd.read_csv(r'..\..\data\raw\fq_spam.csv')
df4 = pd.read_csv(r'..\..\data\raw\spam_or_not_spam.csv')
df5 = pd.read_csv(r'..\..\data\raw\uciml_spam.csv', encoding='latin')
df6 = pd.read_csv(r'..\..\data\raw\vg_email.csv')
df7 = pd.read_csv(r'..\..\data\raw\ps_spam.csv')
df8 = pd.read_csv(r'..\..\data\raw\ay_spam.csv')
df9 = pd.read_csv(r'..\..\data\raw\lingSpam.csv')
df10 = pd.read_csv(r'..\..\data\raw\completeSpamAssassin.csv')
df11 = pd.read_csv(r'..\..\data\raw\enronSpamSubset.csv')
df12 = pd.read_csv(r'..\..\data\raw\underscore_email.csv')
df13 = pd.read_csv(r'..\..\data\raw\SMSSpamCollection.csv')

In [3]:
list_of_df = [df1, df2, df3, df4, df5, df6, df7, df8, df9, df10, df11, df12, df13]
for ds in list_of_df:
    display(ds.describe(include='all'))

       Category                 Message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

       Category                 Message
count      5573                    5573
unique        3                    5158
top         ham  Sorry, I'll call later
freq       4825                      30

       Category                 Message
count      5572                    5572
unique        2                    5157
top         ham  Sorry, I'll call later
freq       4825                      30

                                 email        label
count                             2999  3000.000000
unique                            2872          NaN
top     url URL date not supplied URL           NaN
freq                                10          NaN
mean                               NaN     0.166667
std                                NaN     0.372740
min                                NaN     0.000000
25%                                NaN     0.000000
50%                                NaN     0.000000
75%                                NaN     0.000000
max                                NaN     1.000000

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
count,5572,5572,50,12,6
unique,2,5169,43,10,5
top,ham,"Sorry, I'll call later","bt not his girlfrnd... G o o d n i g h t . . .@""","MK17 92H. 450Ppw 16""","GNT:-)"""
freq,4825,30,3,2,2

,Unnamed: 0,label,text,label_num
count,5171.000000,5171,5171,5171.000000
unique,NaN,2,4993,NaN
top,NaN,ham,Subject: calpine daily gas nomination\r\n>\r\n...,NaN
freq,NaN,3672,20,NaN
mean,2585.000000,NaN,NaN,0.289886
std,1492.883452,NaN,NaN,0.453753
min,0.000000,NaN,NaN,0.000000
25%,1292.500000,NaN,NaN,0.000000
50%,2585.000000,NaN,NaN,0.000000
75%,3877.500000,NaN,NaN,1.000000
max,5170.000000,NaN,NaN,1.000000

                                                    email label
count                                                 179   179
unique                                                150     2
top     You've been selected for a free trial of our p...   ham
freq                                                    4   100

       Category                 Message
count      5573                    5573
unique        3                    5158
top         ham  Sorry, I'll call later
freq       4825                      30

,Unnamed: 0,Body,Label
count,2605.000000,2605,2605.000000
unique,NaN,2591,NaN
top,NaN,Subject: re :\n \n = 20 the virtual girlfriend...,NaN
freq,NaN,4,NaN
mean,1302.000000,NaN,0.166219
std,752.143049,NaN,0.372348
min,0.000000,NaN,0.000000
25%,651.000000,NaN,0.000000
50%,1302.000000,NaN,0.000000
75%,1953.000000,NaN,0.000000
max,2604.000000,NaN,1.000000

         Unnamed: 0   Body        Label
count   6046.000000   6045  6046.000000
unique          NaN   5292          NaN
top             NaN  empty          NaN
freq            NaN    533          NaN
mean    3022.500000    NaN     0.313596
std     1745.474195    NaN     0.463993
min        0.000000    NaN     0.000000
25%     1511.250000    NaN     0.000000
50%     3022.500000    NaN     0.000000
75%     4533.750000    NaN     1.000000
max     6045.000000    NaN     1.000000

        Unnamed: 0.1    Unnamed: 0         Body         Label
count   10000.000000  10000.000000        10000  10000.000000
unique           NaN           NaN         9687           NaN
top              NaN           NaN  Subject: \n           NaN
freq             NaN           NaN           16           NaN
mean    17041.404600  17041.404600          NaN      0.500000
std      9735.989695   9735.989695          NaN      0.500025
min         8.000000      8.000000          NaN      0.000000
25%      8562.000000   8562.000000          NaN      0.000000
50%     17159.000000  17159.000000          NaN      0.500000
75%     25509.250000  25509.250000          NaN      1.000000
max     33698.000000  33698.000000          NaN      1.000000

                                                     text         spam
count                                                5728  5728.000000
unique                                               5695          NaN
top     Subject: re : schedule and more . .  jinbaek ,...          NaN
freq                                                    2          NaN
mean                                                  NaN     0.238827
std                                                   NaN     0.426404
min                                                   NaN     0.000000
25%                                                   NaN     0.000000
50%                                                   NaN     0.000000
75%                                                   NaN     0.000000
max                                                   NaN     1.000000

,category,message,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8
count,5574,5574,0.0,0.0,0.0,0.0,40,22,8
unique,2,5067,NaN,NaN,NaN,NaN,25,12,7
top,ham,\tSorry,NaN,NaN,NaN,NaN,Cost£1.50/pm,Max10mins,Make a strike against it ...
freq,4827,36,NaN,NaN,NaN,NaN,6,6,2
mean,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

the datasets 1,2 and 3 appear to be similar

### Standarizing the dataset

In [4]:
for ds in list_of_df:
    ds.columns = ds.columns.str.lower().str.replace(' ', '_')

In [5]:
for num,ds in enumerate(list_of_df):
    print(num, ds.columns)

0 Index(['category', 'message'], dtype='object')
1 Index(['category', 'message'], dtype='object')
2 Index(['category', 'message'], dtype='object')
3 Index(['email', 'label'], dtype='object')
4 Index(['v1', 'v2', 'unnamed:_2', 'unnamed:_3', 'unnamed:_4'], dtype='object')
5 Index(['unnamed:_0', 'label', 'text', 'label_num'], dtype='object')
6 Index(['email', 'label'], dtype='object')
7 Index(['category', 'message'], dtype='object')
8 Index(['unnamed:_0', 'body', 'label'], dtype='object')
9 Index(['unnamed:_0', 'body', 'label'], dtype='object')
10 Index(['unnamed:_0.1', 'unnamed:_0', 'body', 'label'], dtype='object')
11 Index(['text', 'spam'], dtype='object')
12 Index(['category', 'message', 'unnamed:_2', 'unnamed:_3', 'unnamed:_4',
       'unnamed:_5', 'unnamed:_6', 'unnamed:_7', 'unnamed:_8'],
      dtype='object')

In [6]:
# standardizing all the datasets
df4 = df4[['label','email']].rename(columns={'label':'category','email':'message'})
df5 = df5[['v1','v2']].rename(columns={'v1':'category','v2':'message'})
df6 = df6[['label_num','text']].rename(columns={'label_num':'category','text':'message'})
df7 = df7[['label','email']].rename(columns={'label':'category','email':'message'})
df9 = df9[['label','body']].rename(columns={'label':'category','body':'message'})
df10 = df10[['label','body']].rename(columns={'label':'category','body':'message'})
df11 = df11[['label','body']].rename(columns={'label':'category','body':'message'})
df12 = df12[['spam','text']].rename(columns={'spam':'category','text':'message'})
df13 = df13[['category','message']]

In [7]:
list_of_df = [df1, df2, df3, df4, df5, df6, df7, df8, df9, df10, df11, df12, df13]

In [8]:
for ds in list_of_df:
    print(ds.columns)

Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')
Index(['category', 'message'], dtype='object')

In [9]:
# appending all the datasets into one
df = pd.concat(list_of_df)
df.shape

(66165, 2)

In [10]:
# dropping all the identical rows of data
df = df.drop_duplicates()
df.shape

(42220, 2)

In [11]:
# checking the classes
df['category'].value_counts()

category
0                 21313
1                  9819
ham                9504
spam               1583
{"mode":"full"        1
Name: count, dtype: int64

In [12]:
df = df.loc[~df['category'].astype(str).str.contains(r'{"mode":"full"', regex=True)]
df['category'] = df['category'].replace({'ham': 0, 'spam': 1})

C:\Users\Asif Sayyed\AppData\Local\Temp\ipykernel_18696\1361099758.py:2: FutureWarning: Downcasting behavior in `replace` is deprecated and will be removed in a future version. To retain the old behavior, explicitly call `result.infer_objects(copy=False)`. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['category'] = df['category'].replace({'ham': 0, 'spam': 1})

In [14]:
df['category'].value_counts(normalize=True)

category
0    0.729932
1    0.270068
Name: proportion, dtype: float64

In [15]:
df.to_csv(r'..\..\data\processed\spam_dataset.csv', index=False)

[Next notebook](https://github.com/Asifdotexe/SpamDetection/blob/main/code/notebooks/issue-3-as-data-preprocessing.ipynb)